appendix/appendix-7/index.html

<!DOCTYPE html>
<!--[if IE 8]><html class="no-js lt-ie9" lang="en" > <![endif]-->
<!--[if gt IE 8]><!--> <html class="no-js" lang="en" > <!--<![endif]-->
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  
  <title>Appendix 7 - Sample PDF Validation Service Request - PDF Validator Documentation</title>
  

  <link rel="shortcut icon" href="../../img/favicon.ico">

  
  <link href='https://fonts.googleapis.com/css?family=Lato:400,700|Roboto+Slab:400,700|Inconsolata:400,700' rel='stylesheet' type='text/css'>

  <link rel="stylesheet" href="../../css/theme.css" type="text/css" />
  <link rel="stylesheet" href="../../css/theme_extra.css" type="text/css" />
  <link rel="stylesheet" href="../../css/highlight.css">
  <link href="../../override.css" rel="stylesheet">

  
  <script>
    // Current page data
    var mkdocs_page_name = "Appendix 7 - Sample PDF Validation Service Request";
  </script>
  
  <script src="../../js/jquery-2.1.1.min.js"></script>
  <script src="../../js/modernizr-2.8.3.min.js"></script>
  <script type="text/javascript" src="../../js/highlight.pack.js"></script>
  <script src="../../js/theme.js"></script> 

  
</head>

<body class="wy-body-for-nav" role="document">

  <div class="wy-grid-for-nav">

    
    <nav data-toggle="wy-nav-shift" class="wy-nav-side stickynav">
      <div class="wy-side-nav-search">
        <a href="../.." class="icon icon-home"> PDF Validator Documentation</a>
        <div role="search">
  <form id ="rtd-search-form" class="wy-form" action="../../search.html" method="get">
    <input type="text" name="q" placeholder="Search docs" />
  </form>
</div>
      </div>

      <div class="wy-menu wy-menu-vertical" data-spy="affix" role="navigation" aria-label="main navigation">
        <ul class="current">
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../..">PDF Validation Service Overview</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../architecture/">Architecture of the Core Service</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../policy/">Validation Policy</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../interface_description/">Interface description</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../deployment/">Deploying PDF Validator Web Service</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../tsl_downloader/">TSL file loading without internet</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../lotl_keystore/">Generating keystore for LOTL validation (optional)</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../logging/">Logging</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../monitoring/">Monitoring Service</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../testing/">Automation testing</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../issues/">Known Issues</a>
        
    </li>
<li>
          
            <li>
    <li class="toctree-l1 ">
        <a class="" href="../../documentation/">Documentation updating</a>
        
    </li>
<li>
          
            <li>
    <ul class="subnav">
    <li><span>Appendixes</span></li>

        
            
    <li class="toctree-l1 ">
        <a class="" href="../appendix-1/">Appendix 1 - Non-Functional Requirements</a>
        
    </li>

        
            
    <li class="toctree-l1 ">
        <a class="" href="../appendix-2/">Appendix 2 - Functional Requirements</a>
        
    </li>

        
            
    <li class="toctree-l1 ">
        <a class="" href="../appendix-3/">Appendix 3 - Validation Policy</a>
        
    </li>

        
            
    <li class="toctree-l1 ">
        <a class="" href="../appendix-4/">Appendix 4 - Validation Constraint Configuration</a>
        
    </li>

        
            
    <li class="toctree-l1 ">
        <a class="" href="../appendix-5/">Appendix 5 - Sample Validation Policy Configuration</a>
        
    </li>

        
            
    <li class="toctree-l1 ">
        <a class="" href="../appendix-6/">Appendix 6 - ValidationService WSDL</a>
        
    </li>

        
            
    <li class="toctree-l1 current">
        <a class="current" href="./">Appendix 7 - Sample PDF Validation Service Request</a>
        
            <ul>
            
                <li class="toctree-l3"><a href="#appendix-7-sample-pdf-validation-service-request">Appendix 7 - Sample PDF Validation Service Request</a></li>
                
            
            </ul>
        
    </li>

        
            
    <li class="toctree-l1 ">
        <a class="" href="../appendix-8/">Appendix 8 - Sample Response Data Blocks - positive response</a>
        
    </li>

        
            
    <li class="toctree-l1 ">
        <a class="" href="../appendix-9/">Appendix 9 - Sample Response Data Blocks – negative response</a>
        
    </li>

        
            
    <li class="toctree-l1 ">
        <a class="" href="../appendix-10/">Appendix 10 - Summary of modifications made to the DSS library</a>
        
    </li>

        
    </ul>
<li>
          
        </ul>
      </div>
      &nbsp;
    </nav>

    <section data-toggle="wy-nav-shift" class="wy-nav-content-wrap">

      
      <nav class="wy-nav-top" role="navigation" aria-label="top navigation">
        <i data-toggle="wy-nav-top" class="fa fa-bars"></i>
        <a href="../..">PDF Validator Documentation</a>
      </nav>

      
      <div class="wy-nav-content">
        <div class="rst-content">
          <div role="navigation" aria-label="breadcrumbs navigation">
  <ul class="wy-breadcrumbs">
    <li><a href="../..">Docs</a> &raquo;</li>
    
      
        
          <li>Appendixes &raquo;</li>
        
      
    
    <li>Appendix 7 - Sample PDF Validation Service Request</li>
    <li class="wy-breadcrumbs-aside">
      
    </li>
  </ul>
  <hr/>
</div>
          <div role="main">
            <div class="section">
              
                <h1 id="appendix-7-sample-pdf-validation-service-request">Appendix 7 - Sample PDF Validation Service Request</h1>
<pre><code class="xml">&lt;S:Envelope xmlns:S=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
    &lt;S:Body&gt;
        &lt;ns2:validateDocument xmlns:ns2=&quot;http://ws.dss.esig.europa.eu/&quot;&gt;
            &lt;document&gt;
                &lt;bytes&gt;
                    JVBERi0xLjQKJcOkw7zDtsOfCjIgMCBvYmoKPDwvTGVuZ3RoIDMgMCBSL0ZpbHRlci9GbGF0ZURlY29kZT4+
                    CnN0cmVhbQp4nC3JuwpCQQwE0D5fMbXgmsR9whJQ0MLuQsBC7Hx0grfx910fDAzDHA6CFz3B4LFSS0FRo4SK+
                    UrHBR4/G5nvtHVKeVApMWT4Bau9QBR+O3UWW2pnNem8Nv1X5MTZautcvly5fe6Nnf1AO6eJJrwBHoMb7Qplbm
                    RzdHJlYW0KZW5kb2JqCgozIDAgb2JqCjExNgplbmRvYmoKCjUgMCBvYmoKPDwvTGVuZ3RoIDYgMCBSL0ZpbHR
                    lci9GbGF0ZURlY29kZS9MZW5ndGgxIDE4NTI4Pj4Kc3RyZWFtCnic7Xt7eJTF9fCZed+9ZW9vbrtJdrPvu7vZ3
                    Hazu+QCJESyIQkBAhIgYEKJJCSBRC5ZNgmIBYlViwQV6v1SAduiVvDHJoAGtJpatdXWQm9WbRVsbestLW3RTy
                    tkvzOzy83a/r7f83zP8/3xdd+cOWfOOTNz5syZM/Nukv7IQBcYYBAECHWsbQ+7jPoUAPgJAEnp2NCvWN4ssSF
                    9CkDz5srwqrWRA2+4AXTPAKiGV63ZtHL73R+OA5jDAJZPu7vaO5/r/oEJILcb+5jcjYwFE5s0WN+L9Zzutf3XF
                    qmWeLH+AtZ9a3o72j/IeSQL66exnrG2/dpwp+orKoA8LdaVde1ru355/UAy1vMBkk+Ee/v6AQ0FmPopk4cjXeE
                    PXv4oAFCegTbUIY/gwz4GJNWsTgVRpdZodUnw/+dHdTvCXJAR7MJdgGsZewfhXYT3JubEzqpWg3vimtgpIRWVn0
                    gAgAfugT2QA6fJJHgexmAOPALV0Ah3QT0ch4Nggk3kxyCCG2rhMfAQGSjMBCtRwf3wBiyDCPwBTkE+NMDbJAX7q
                    YMwWKA89j6WDXBL7ChqJUEN/BccI2vIIgggPYv6iBdH3hkbAyvkx16NvY61h+APJCc2DLOQ+iMkQx5shW9AClwDr
                    8TOoqU5sAIeJZvJ++CENtghlopDsdUwDY7Ar0gDUvNgk+p13RFYg62+TaxkLHYy9id4ViTQhT19DW5Bi0dgjPqFG
                    tVeUCAXroAroR2lX4U3SCqZJIRiebEZsfuR+yj8jXrpS4IG7fDCbFgOt8HD6I3X4F34mOhJGXmI7MfnZ+TPqtf
                    RtgYYgOtwbz2E3nsUDsBRMolMolZqRW9ZoQAWo2wn7MPxD8EJ0kBayBj5vrBPFZyoiqXF0mN/isWgEJrRwj3wfRzj
                    DAmiDo4guIR+0SH2q4rP3YAz7IRvwgn4GdrxNvr9Y/iUFOLzDr2ebo1dFXss9ge0RQsyTIUFsBR6YQNshG/hqj
                    4PL8BfyedUh5rHxRdV16lOx+5A3+bCDLR9Pmovwr534CqNwCg+r+Esk4mCs5hKriQLySqyk9xDRskb5A2qpk6
                    6nn4gRIUfC78VJ6tUsQrsyQIOHNcNV0E3rsD16O07cL6PwYvwMkknuaQIZ/Qatv+ETqO1+HybHqdvCzcLO8Wz
                    qq9PnJr4cOLz2BBoMMrq0Q8D8Dh64S/EgjYUkGtIH/k9Wr6LHhZMgiS4hTKhWmgSWoRbhLuEHwk/FSPifvFN
                    1WxVu2q/pn1i3cTPYg2xm4BlCTXalQc+KIUpGD8rMZpWo31hfCKwGW6AIbgd4+UO2Av7cd7PwcvwK3gLPsIVA
                    OJEm3tw9LUYdTeT2/G5nxwg3ycvkpfJO+QT9lAXPvl0Mq2iNXQmXUVvxucueoK+Rt8T7EKHsFUYxGe38KTwhgi
                    iKMZUxfjMUu1QPar+sSZfM0uzQvuTs+PnCs+1nHt7AiayJr4ycc/E9yf+FFsS24T2e6AI/GjpNrTyfozBffg8j
                    pH4JLyEufvX3Na/EUpUGPEZxI3R4MNVqyL1ZDY+88gCfBbjcxVZik87WUG68dlKBsnXyI3kJnIbuZs/9+Hc9pHv
                    kifxeYocw+dX5CT5I/mA/I1iEFMBo9lD82iAluNMa2g9nU8X4rOK9uITphG6AVfoUXqIHqWvCamCRygS2oX1wv
                    3CfwnPC78UPhOp6BMDYqW4RFwl3igeF38mvi5+rpJVdapu1W7V82qbulS9WH2N+ 6UznvXCVUIS2dxWJS0JnsTP
                    ZgQewinFWEsbMhFXyOt5AxDCd8a1c9hG+  (Contentcs 
                    (Contents truncated for readability)
                &lt;/bytes&gt;
                &lt;name&gt;/fixedpath/file.pdf&lt;/name&gt;
                &lt;absolutePath&gt;/fixedpath/file.pdf&lt;/absolutePath&gt;
                &lt;mimeType&gt;PDF&lt;/mimeType&gt;
                &lt;nextDocument&gt;&lt;/nextDocument&gt;
            &lt;/document&gt;
            &lt;diagnosticDataToBeReturned&gt;true&lt;/diagnosticDataToBeReturned&gt;
        &lt;/ns2:validateDocument&gt;
    &lt;/S:Body&gt;
&lt;/S:Envelope&gt;
</code></pre>
              
            </div>
          </div>
          <footer>
  
    <div class="rst-footer-buttons" role="navigation" aria-label="footer navigation">
      
        <a href="../appendix-8/" class="btn btn-neutral float-right" title="Appendix 8 - Sample Response Data Blocks - positive response"/>Next <span class="icon icon-circle-arrow-right"></span></a>
      
      
        <a href="../appendix-6/" class="btn btn-neutral" title="Appendix 6 - ValidationService WSDL"><span class="icon icon-circle-arrow-left"></span> Previous</a>
      
    </div>
  

  <hr/>

  <div role="contentinfo">
    <!-- Copyright etc -->
    
  </div>

  Built with <a href="http://www.mkdocs.org">MkDocs</a> using a <a href="https://github.com/snide/sphinx_rtd_theme">theme</a> provided by <a href="https://readthedocs.org">Read the Docs</a>.
</footer>
	  
        </div>
      </div>

    </section>

  </div>

<div class="rst-versions" role="note" style="cursor: pointer">
    <span class="rst-current-version" data-toggle="rst-current-version">
      
      
        <span><a href="../appendix-6/" style="color: #fcfcfc;">&laquo; Previous</a></span>
      
      
        <span style="margin-left: 15px"><a href="../appendix-8/" style="color: #fcfcfc">Next &raquo;</a></span>
      
    </span>
</div>

</body>
</html>
